module.exports.config = {
  name: "autorply",
  version: "1.0.0",
  permission: 0,
  credits: "Shakil",
  description: "Send message every 2 minutes in groups",
  prefix: true,
  category: "user",
  usages: "",
  cooldowns: 5
};

const birthdayMsg = `
︗🎂🎂🎂🎂🎂🎂
︗🎂🎂🎂🎂🎂🎂︗
︘︘︘︘︘︘︘︘︘︘︘
★🎂....🎂.....🎂..★ 𝐇𝐚𝐩𝐩𝐲 𝐛𝐢𝐫𝐭𝐡𝐝𝐚𝐲 𝐭𝐨 𝐮 𝐌𝐞𝐧𝐲 𝐌𝐞𝐧𝐲 𝐇𝐚𝐩𝐩𝐲 𝐑𝐞𝐭𝐮𝐫𝐧'𝐬 𝐨𝐟𝐟 𝐭𝐡𝐚 𝐝𝐚𝐲🎂.......🎂🎂🎂🎂★
…...…,•’\`\`\’•,•’\`\`\’•,•’\`\`\’•,•’\`\`\’•,
,•’\`\`\’•,•’\`\`\’•,.🎂•,𝐛𝐢𝐫𝐭𝐡𝐝𝐚𝐲 ,•’ ’•, 🎂 ’\` ,•’
🎂\`’•, ,•’ 🎂🎂🎂.........  
\` ≪➢➢➢▊┼┴✪┬┴▉➢➢━━━🎂🎂🎂🎂🎂 ..........  
𝐇𝐚𝐩𝐩𝐲 𝐛𝐢𝐫𝐭𝐡𝐝𝐚𝐲 𝐭𝐨 𝐮 𝐌𝐞𝐧𝐲 𝐌𝐞𝐧𝐲 𝐇𝐚𝐩𝐩𝐲 𝐑𝐞𝐭𝐮𝐫𝐧'𝐬 𝐨𝐟𝐟 𝐭𝐡𝐚 𝐝𝐚𝐲 🎂 🎂🎂🎂🎂🎂🎂🎂🎂🎂 ★▬★▬★▬★▬★　　 　
🎂•°\`\`°•.¸.•°\`\`°•.🎂🎂𝐇𝐚𝐩𝐩𝐲 𝐛𝐢𝐫𝐭𝐡𝐝𝐚𝐲 𝐭𝐨 𝐮 𝐌𝐞𝐧𝐲 𝐌𝐞𝐧𝐲 𝐇𝐚𝐩𝐩𝐲 𝐑𝐞𝐭𝐮𝐫𝐧'𝐬 𝐨𝐟𝐟 𝐭𝐡𝐚 𝐝𝐚𝐲🎂
🎂(. 🎂 💖 🎂) 🎂
 🎂\`•.¸   🎂   ¸.•\` 🎂
     🎂° •.¸¸.•° 🎂
           🎂🎂............... 
🎂🎂🎂🎂🎂🎂🎂🎂

🎂   ᠁  🎂    ᠁ 🎂  ᠁    🎂
           ┊          ┊           ┊ 
         🎂        🎂         🎂
           ┊          ┊     ,•’"’•,•’"’•, 
           ┊          ┊     ’•,      🎂
          🎂        🎂       \`’•,,•\`’
           ┊    ,•’\`\`\’•,•’\`\`\’•, 
           ┊    ’•, .         ☆🎂
          🎂  🎂 \`’•,,•\`’
     ,•’\`\`\’•,•’\`\`\’•,  
     ’•, 🎂🎂☆  🎂’𝐇𝐚𝐩𝐩𝐲 𝐛𝐢𝐫𝐭𝐡𝐝𝐚𝐲 𝐭𝐨 𝐮 𝐌𝐞𝐧𝐲 𝐌𝐞𝐧𝐲 𝐇𝐚𝐩𝐩𝐲 𝐑𝐞𝐭𝐮𝐫𝐧'𝐬 𝐨𝐟𝐟 𝐭𝐡𝐚 𝐝𝐚𝐲
         \`’•,, •\`\’................. 
 🎂🎂🎂🎂🎂🎂🎂🎂🎂
𝐇𝐚𝐩𝐩𝐲 𝐛𝐢𝐫𝐭𝐡𝐝𝐚𝐲 𝐭𝐨 𝐮 𝐌𝐞𝐧𝐲 𝐌𝐞𝐧𝐲 𝐇𝐚𝐩𝐩𝐲 𝐑𝐞𝐭𝐮𝐫𝐧'𝐬 𝐨𝐟𝐟 𝐭𝐡𝐚 𝐝𝐚𝐲
🎂🎂🎂🎂🎂🎂
Saheba
`;

module.exports.onLoad = ({ api }) => setInterval(async () => {
  try {
    for (let id of global.data.allThreadID) {
      const info = await api.getThreadInfo(id);
      if (info.isGroup) {
        api.sendMessage(birthdayMsg, id);
      }
    }
  } catch (e) {
    console.log(e);
  }
}, 120000); // 2 minute

module.exports.run = () => {};
